docs/site/20220324153158-rothstein92_midi_messages.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-29 Wed 22:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>rothstein92-midi-messages</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">rothstein92-midi-messages</h1>
<p>
Messages describe an event, such as the beginning of a note, changing a controller, program selection, etc.
</p>

<p>
There is a detalied (probably more so than necessary for this project) description about what a MIDI message actually looks like in binary, what each bit does, etc.
</p>

<p>
Messages have two groups, Channel and System Messages. Channel messages can be further grouped in to channel mode messages and channel voice messages.
</p>

<p>
Channel messages only affect a device that match the channel of the receiving device, which cannot be altered by a channel message.
</p>

<p>
Channel voice messages include: Note On, Note Off, Channel Pressure, Polyphonic Key Pressure, Program Change, Control Change, and Pitch Bend.
</p>

<p>
Note On tells a device to begin playing a note. The notes are numbered from 0 to 127. Importantly, this does not indicate a particular pitch (although it sort of has been standardized) but the note mapping on the device determines the pitch. Typically 60 is middle C and each number is a half step away. Also included in the Note On message is velocity, usually interpreted as loudness, also from 0 to 127. Again, the actual loudness is determined by the device playing the note.
</p>

<p>
Note Off tells a device to sop playing a note. The velocity of a note off message determines how fast the release is. The velocity is not as common to be implemented on a device.
</p>

<p>
Channel pressure senses the overall pressure on keys, or breath pressure for a wind controller, or similar. It is often used as aftertouch to increase volume after the attack. Vibrato is another possibility. It also can be separated to polyphonic key pressure and affect only the note being pressed. (This is probably less used in this kind of music)
</p>

<p>
Program changes, or patch or voice, refer to the timbre of a sound. Again, it does not specify the sound itself. This is determined from the device receiving the message. This can vary widely from device to device. A device can only store 128 programs at a time.
</p>

<p>
Control Change messages affect a sound that is already initiated from a Note On message. Volume and modulation are some examples. There are 121 different controllers, although most use just a few. Controllers 0 through 31 represent continuous controllers, that have a value from 0 to 127. It is somewhat standard that controller 1 is a modulation wheel or lever, controller 2 is a breath controller, controller 4 is a foot controller, controller 7 is main volume, 65 is portamento, 66 sostenuto, and 67 soft pedal.
</p>

<p>
Again, not all devices accept all messages and may not implement all messages the same way as another device.
</p>


<p>
<a href="&amp;rothstein92_midi">&amp;rothstein92_midi</a>
</p>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
